<?php

	function userOnlineOffline($uLastActionTime)
	{
        //เวลาที่จะเช็ค เอาเวลาปัจจุบัน  ลบด้วย 180  (180 คือ 30นาที) นั้นคือ ย้อนหลังไป 30 นาที
		$timeCheck	=	time() - 180;

        // ถ้าความเลือนไหวของสมาชิก มากกว่า เวลาที่เช็ค นั้นคือมากกว่า 30 นาที เขาต้องออนไลน์ในช่วง 29- ปัจจุบันแน่นอน
		if ($uLastActionTime > $timeCheck)
			// แสดงว่าออนไลน์อยู่
			return 'ออนไลน์ในขณะนี้';
		else
			// ไม่อยู่แล้ว
			return 'ออฟไลน์';
	}

    //วิธีใช้งาน
    //เหตุการณ์ที่หนึ่ง
    //จำลองว่า เวลาความเลือนไหวของสมาชิกคือ ณ ตอนนี้ แน่นอนว่า ต้องออนไลน์อยู่
    $uLastActionTime = time();

    echo userOnlineOffline($uLastActionTime);

    //วิธีใช้งาน
    //เหตุการณ์ที่หนึ่ง
    //จำลองว่า เวลาความเลือนไหวของสมาชิกคือ ผ่านไป 185 วินาที นัน้คือ เลย 30 นาทีแล้ว เขาต้องออฟไลนืแน่ๆ
    $uLastActionTime = time() - 185;

    echo userOnlineOffline($uLastActionTime);

?>